{
  _id: ObjectId
  (
  "57bddf5a49c80559b644b078"
  ),
  route: "automatic-release",
  title: "Speed up your development life cycle with automatic releases",
  subTitle: "With Travis CI, Heroku, Githooks and Codecov",
  date: "Apr 13, 2016",
  topImageUrl: "/images/blog/posts/easyblog/4.jpg",
  componentList: [
    {
      componentId: "title"
    },
    {
      componentId: "subTitle"
    },
    {
      componentId: "articleSignature"
    },
    {
      componentId: "text",
      text: "Losing time with deploying your \"small\" projects manually? In 30 minutes you setup an automatic deploy process with this tutorial."
    },
    {
      componentId: "subTitle",
      text: "Step by step, but where to start?"
    },
    {
      componentId: "text",
      text: "The prerequisites for this tutorial are:"
    },
    {
      componentId: "unorderedList",
      text: [
        [
          "Your application has a repository on ",
          {
            link: "Github",
            url: "https://github.com",
            openInOtherTab: true
          },
          "."
        ],
        [
          "Your application is hosted on ",
          {
            link: "Heroku",
            url: "https://heroku.com",
            openInOtherTab: true
          },
          "."
        ]
      ]
    },
    {
      componentId: "text",
      text: "Follow the steps below, and you are up in no time:"
    },
    {
      componentId: "orderedList",
      text: [
        "Link your github repository to your heroku app",
        "Setup a Travis account and link your github project"
      ]
    },
    {
      componentId: "quote",
      text: "Add a quote!"
    },
    {
      componentId: "expandArticle"
    },
    {
      componentId: "subTitle",
      text: "Link Github to Heroku"
    },
    {
      componentId: "text",
      text: "We will first start with the most basic automatic deployment. You don't need Travis and other fancy tools to deploy automatically. With only Github and Heroku, an automatic deployment can be realised. Go to https://dashboard.heroku.com/apps/YOUR-APP/deploy and choose deployment method 'Github'. Link your app to the corresponding Github repository and enable the Automatic deploy. Afterwards, deploy something to the Github deployment branch you specified on Heroku and see the automatic deployment taking place to your heroku app. When you are having issues, make sure your deployment branch contains at least a Procfile for Heroku, so it knows what to do for deployment."
    },
    {
      componentId: "quote",
      text: "Tip: Don't forget, you are using a public github repository for deployment to your environment: use the Heroku Config Variables for passwords and other secret stuff."
    },
    {
      componentId: "quote",
      text: "Add a Procfile to Heroku."
    },
    {
      componentId: "subTitle",
      text: "Setup a Travis CI account"
    },
    {
      componentId: "text",
      text: [
        "Ok, now that we have a simple and basic automatic release, we will take it one step further. Why adding Travis CI to this process? Well, as we want to make sure that are project is always in a healthy and deployable state, we will add Travis as a sort of gatekeeper. Travis will perform all needed pre- and post processing that you want, all by declaring them in a simple file.",
        {
          componentId: "orderedList",
          text: [
            "Start by again disabling the automatic deployment at the Heroku page. We don't need it anymore, as travis will now trigger the Heroku build and release. So push 'Disable Automatic Deploys' on the Heroku website.",
            [
              "Go to the Travis CI website, setup an account if you don't already have one and read their ",
              {
                link: "manual",
                url: "https://docs.travis-ci.com/user/getting-started/",
                openInOtherTab: true
              },
              " on how to get started."
            ],
            "As specified in the getting-started guide: the only thing you will need to do in your project is adding a .travis.yml file containing some basic info: ",
            {
              componentId: "unorderedList",
              text: [
                "language",
                "before_script, script, after_script: specify all scripts you want Travis to perform in all specific phases",
                [
                  "deploy: specify heroku as provider, the secure api key related to it and the app. Make sure to encrypt your key! More info can be found in ",
                  {
                    link: "the travis to heroku sector.",
                    url: "https://docs.travis-ci.com/user/deployment/heroku/",
                    openInOtherTab: true
                  }
                ]
              ]
            },
            "Pushing your travis.yml file to the specified branch, should now trigger a successful build at Travis, and afterwards Travis should deploy your application to Heroku!"
          ]
        }
      ]
    },
    {
      componentId: "quote",
      text: [
        "If interested, a working example can be found ",
        {
          link: "here",
          url: "https://github.com/easybird/salesfunnel-abinbev/blob/develop/.travis.yml",
          openInOtherTab: true
        }
      ]
    },
    {
      componentId: "subTitle",
      text: "Add automatic testing and test coverage measurement with Istanbul and Codecov"
    },
    {
      componentId: "quote",
      text: "This part is specific for Node.js applications"
    },
    {
      componentId: "text",
      text: "We added Travis to the build process, but we didn't really use it's power yet. This section will a part of it's power by adding a test battery to the automatic deployment process. We don't want to deploy our application without decent testing taking place!"
    },
    {
      componentId: "text",
      text: [
        "If your application doesn't yet contain any tests, first add some tests! We are using ",
        {
          link: "Mocha",
          url: "https://mochajs.org/",
          openInOtherTab: true
        },
        " and ",
        {
          link: "Chai",
          url: "https://http://chaijs.com/",
          openInOtherTab: true
        },
        ". Add a test script to your package.json which triggers your testing battery."
      ]
    }
  ],
  creationDate: ISODate
  (
  "2016-04-13T10:50:42.389Z"
  ),
  modificationDate: ISODate
  (
  "2016-04-13T10:50:42.389Z"
  ),
  publicationDate: ISODate
  (
  "2016-04-13T10:50:42.389Z"
  ),
  isDeleted: false
}